In [1]:
import pandas as pd
oil_prices = pd.DataFrame({
    'U.K. Brent': {'2013-Q1': 112.9, '2013-Q2': 103.0,
                   '2013-Q3': 110.1, '2013-Q4': 109.4},
     'Dubai': {'2013-Q1': 108.1, '2013-Q2': 100.8,
                   '2013-Q3': 106.1, '2013-Q4': 106.7},
     'West Texas': {'2013-Q1': 94.4, '2013-Q2': 94.2,
                   '2013-Q3': 105.8, '2013-Q4': 97.4},
                   
}
)
oil_prices

         U.K. Brent  Dubai  West Texas
2013-Q1       112.9  108.1        94.4
2013-Q2       103.0  100.8        94.2
2013-Q3       110.1  106.1       105.8
2013-Q4       109.4  106.7        97.4

In [2]:
oil_prices['Dubai'][0]

108.1

In [3]:
oil_prices.loc[:,oil_prices.loc['2013-Q1'] > 110 ]

         U.K. Brent
2013-Q1       112.9
2013-Q2       103.0
2013-Q3       110.1
2013-Q4       109.4

In [4]:
oil_prices.iloc[0,1:3]

Dubai         108.1
West Texas     94.4
Name: 2013-Q1, dtype: float64

In [5]:
oil_prices.idxmax()

U.K. Brent    2013-Q1
Dubai         2013-Q1
West Texas    2013-Q3
dtype: object

In [7]:
oil_prices

         U.K. Brent  Dubai  West Texas
2013-Q1       112.9  108.1        94.4
2013-Q2       103.0  100.8        94.2
2013-Q3       110.1  106.1       105.8
2013-Q4       109.4  106.7        97.4

In [10]:
oil_prices.unstack()

U.K. Brent  2013-Q1    112.9
            2013-Q2    103.0
            2013-Q3    110.1
            2013-Q4    109.4
Dubai       2013-Q1    108.1
            2013-Q2    100.8
            2013-Q3    106.1
            2013-Q4    106.7
West Texas  2013-Q1     94.4
            2013-Q2     94.2
            2013-Q3    105.8
            2013-Q4     97.4
dtype: float64

In [13]:
oil_prices.stack()

2013-Q1  U.K. Brent    112.9
         Dubai         108.1
         West Texas     94.4
2013-Q2  U.K. Brent    103.0
         Dubai         100.8
         West Texas     94.2
2013-Q3  U.K. Brent    110.1
         Dubai         106.1
         West Texas    105.8
2013-Q4  U.K. Brent    109.4
         Dubai         106.7
         West Texas     97.4
dtype: float64

In [22]:
oil_prices.reset_index().iloc[:,0].str.split('-',expand = False)

0    [2013, Q1]
1    [2013, Q2]
2    [2013, Q3]
3    [2013, Q4]
Name: index, dtype: object

In [23]:
oil_prices.reset_index().iloc[:,0].str.split('-',expand = True)

      0   1
0  2013  Q1
1  2013  Q2
2  2013  Q3
3  2013  Q4

In [24]:
oil_prices

         U.K. Brent  Dubai  West Texas
2013-Q1       112.9  108.1        94.4
2013-Q2       103.0  100.8        94.2
2013-Q3       110.1  106.1       105.8
2013-Q4       109.4  106.7        97.4